// Task35. Задайте одномерный массив из 123 случайных чисел.
//         Найдите количество элементов массива, значения которых
//         лежат в отрезке [10, 99].

int[] CreateArrayRndInt(int size, int min, int max) // Это называется сигнатура метода 
{
    int[] arr = new int[size];
    Random rnd = new Random();
    for (int i = 0; i < arr.Length; i++)
    {
        arr[i] = rnd.Next(min, max + 1); // +1 потому что в методе Next интервал не включен
    }
    return arr;
}

void PrintArray(int[] arr)
{
    Console.Write("[");
    for (int i = 0; i < arr.Length; i++)
    {
        if (i < arr.Length - 1) Console.Write($"{arr[i]}, ");
        else Console.Write($"{arr[i]}");
    }
    Console.WriteLine("]");
}

int CountToDigitNumbers(int[] arr)
{
    int count = 0;
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i] >= 10 && arr[i] <= 99)
            count++;
    }
    return count;
}

int[] array = CreateArrayRndInt(123, -200, 200);
PrintArray(array);

int сountToDigitNumbers = CountToDigitNumbers(array);
Console.WriteLine($"Количество двухзначных чисел: {сountToDigitNumbers}");